In [3]:
import pandas as pd

In [2]:
pd.__version__

'1.0.4'

In [4]:
data = [10, 23, 34, 35, 45, 59]

In [9]:
data

[10, 23, 34, 35, 45, 59]

In [6]:
type(data)

list

In [26]:
df = pd.DataFrame(data)

In [27]:
df

    0
0  10
1  23
2  34
3  35
4  45
5  59

In [28]:
df.shape

(6, 1)

In [33]:
df.rename(columns={0: 'Score'}, inplace= True)

In [34]:
df

   Score
0     10
1     23
2     34
3     35
4     45
5     59

In [35]:
df['Score']

0    10
1    23
2    34
3    35
4    45
5    59
Name: Score, dtype: int64

In [37]:
df.min()

Score    10
dtype: int64

In [38]:
df.max()

Score    59
dtype: int64

In [41]:
df.median()

Score    34.5
dtype: float64

In [44]:
df.describe()

           Score
count   6.000000
mean   34.333333
std    16.990193
min    10.000000
25%    25.750000
50%    34.500000
75%    42.500000
max    59.000000